zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal.c
#if defined (DBGMCU_CR_DBG_DBGLP)
/**
  * @brief  Enable the Debug Module during Domain1 Low Power mode
  * @retval None
  */
void HAL_EnableDBGLPMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_DBGLP);
}

/**
  * @brief  Disable the Debug Module during Domain1 Low Power mode
  * @retval None
  */
void HAL_DisableDBGLPMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_DBGLP);
}
#endif /* DBGMCU_CR_DBG_DBGLP */

/**
  * @brief Configure the internal voltage reference buffer voltage scale.
  * @param VoltageScaling  specifies the output voltage to achieve
  *          This parameter can be one of the following values:
  *            @arg SYSCFG_VREFBUF_VOLTAGE_SCALE0: VREF_OUT1 around 2.5 V.
  *                                                This requires VDDA equal to or higher than 2.8 V.
  *            @arg SYSCFG_VREFBUF_VOLTAGE_SCALE1: VREF_OUT2 around 2.048 V.
  *                                                This requires VDDA equal to or higher than 2.4 V.
  *            @arg SYSCFG_VREFBUF_VOLTAGE_SCALE2: VREF_OUT3 around 1.8 V.
  *                                                This requires VDDA equal to or higher than 2.1 V.
  *            @arg SYSCFG_VREFBUF_VOLTAGE_SCALE3: VREF_OUT4 around 1.65 V.
  *                                                This requires VDDA equal to or higher than 1.9 V.
  * @retval None
  */
void HAL_SYSCFG_VREFBUF_VoltageScalingConfig(uint32_t VoltageScaling)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_VREFBUF_VOLTAGE_SCALE(VoltageScaling));

  MODIFY_REG(VREFBUF->CSR, VREFBUF_CSR_VRS, VoltageScaling);
}

/**
  * @brief Configure the internal voltage reference buffer high impedance mode.
  * @param Mode  specifies the high impedance mode
  *          This parameter can be one of the following values:
  *            @arg SYSCFG_VREFBUF_HIGH_IMPEDANCE_DISABLE: VREF+ pin is internally connect to VREFINT output.
  *            @arg SYSCFG_VREFBUF_HIGH_IMPEDANCE_ENABLE: VREF+ pin is high impedance.
  * @retval None
  */
void HAL_SYSCFG_VREFBUF_HighImpedanceConfig(uint32_t Mode)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_VREFBUF_HIGH_IMPEDANCE(Mode));

  MODIFY_REG(VREFBUF->CSR, VREFBUF_CSR_HIZ, Mode);
}

/**
  * @brief  Tune the Internal Voltage Reference buffer (VREFBUF).
  * @retval None
  */
void HAL_SYSCFG_VREFBUF_TrimmingConfig(uint32_t TrimmingValue)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_VREFBUF_TRIMMING(TrimmingValue));

  MODIFY_REG(VREFBUF->CCR, VREFBUF_CCR_TRIM, TrimmingValue);
}

/**
  * @brief  Enable the Internal Voltage Reference buffer (VREFBUF).
  * @retval HAL_OK/HAL_TIMEOUT
  */
HAL_StatusTypeDef HAL_SYSCFG_EnableVREFBUF(void)
{
  uint32_t  tickstart;

  SET_BIT(VREFBUF->CSR, VREFBUF_CSR_ENVR);

  /* Get Start Tick*/
  tickstart = HAL_GetTick();

  /* Wait for VRR bit  */
  while (READ_BIT(VREFBUF->CSR, VREFBUF_CSR_VRR) == 0UL)
  {
    if ((HAL_GetTick() - tickstart) > VREFBUF_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  return HAL_OK;
}

/**
  * @brief  Disable the Internal Voltage Reference buffer (VREFBUF).
  *
  * @retval None
  */
void HAL_SYSCFG_DisableVREFBUF(void)
{
  CLEAR_BIT(VREFBUF->CSR, VREFBUF_CSR_ENVR);
}

#if defined (SYSCFG_DUAL_ETH_SUPPORT)
/**
  * @brief  Ethernet 1 or 2 PHY Interface Selection either MII, RMII or RGMII
  * @param  SYSCFG_ETHInterface: Selects the Ethernet 1 or 2 PHY interface
  *   This parameter can be one of the following values:
  *   @arg SYSCFG_ETH_MII : Select the Media Independent Interface
  *   @arg SYSCFG_ETH_RGMII : Select the reduced gigabit media-independent interface
  *   @arg SYSCFG_ETH_RMII: Select the Reduced Media Independent Interface
  * @retval None
  */
void HAL_SYSCFG_ETHInterfaceSelect(uint32_t SYSCFG_ETHInterface)
{
  assert_param(IS_SYSCFG_ETHERNET_CONFIG(SYSCFG_ETHInterface));
  SYSCFG->PMCSETR = (uint32_t)(SYSCFG_ETHInterface);
}
#endif /* SYSCFG_DUAL_ETH_SUPPORT */

/**
  * @brief  Enables the booster to reduce the total harmonic distortion of the analog
  *         switch when the supply voltage is lower than 2.7 V.
  * @note   Activating the booster allows to guaranty the analog switch AC performance
  *         when the supply voltage is below 2.7 V: in this case, the analog switch
  *         performance is the same on the full voltage range
  * @retval None
  */
void HAL_SYSCFG_EnableBOOST(void)
{
  SYSCFG->PMCSETR = SYSCFG_PMCSETR_EN_BOOSTER;

}

/**
  * @brief  Disables the booster
  * @note   Activating the booster allows to guaranty the analog switch AC performance
  *         when the supply voltage is below 2.7 V: in this case, the analog switch
  *         performance is the same on the full voltage range
  * @retval None
  */
void HAL_SYSCFG_DisableBOOST(void)
{
  SYSCFG->PMCCLRR = SYSCFG_PMCCLRR_EN_BOOSTER;
}

/**
  * @brief  To Enable optimize the I/O speed when the product voltage is low.
  * @note   This bit is active only if PRODUCT_BELOW_25V user option bit is set. It must be
  *         used only if the product supply voltage is below 2.5 V. Setting this bit when VDD is
  *         higher than 2.5 V might be destructive.
  * @param  SYSCFG_HighSpeedSignal: Signal selection (TRACE, QUADSPI...)
  *   This parameter can be one or a combination of the following values:
  *   @arg SYSCFG_HIGHSPEED_TRACE_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_QUADSPI_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_ETH_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SDMMC_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI_SIGNAL
  * @retval None
  */
void HAL_SYSCFG_EnableIOSpeedOptimize(uint32_t SYSCFG_HighSpeedSignal)
{
  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_TRACE_SIGNAL) == SYSCFG_HIGHSPEED_TRACE_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN0R, 0x1018U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_QUADSPI_SIGNAL) == SYSCFG_HIGHSPEED_QUADSPI_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN1R, 0x1018U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_ETH1_SIGNAL) == SYSCFG_HIGHSPEED_ETH1_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN2R, 0x1018U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_ETH2_SIGNAL) == SYSCFG_HIGHSPEED_ETH2_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN3R, 0x1018U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_SDMMC1_SIGNAL) == SYSCFG_HIGHSPEED_SDMMC1_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN4R, 0x1018U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_SDMMC2_SIGNAL) == SYSCFG_HIGHSPEED_SDMMC2_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN5R, 0x1018U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_SPI1_SIGNAL) == SYSCFG_HIGHSPEED_SPI1_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN6R, 0x1018U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_SPI2_SIGNAL) == SYSCFG_HIGHSPEED_SPI2_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN7R, 0x1018U);
  }

