zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal.c
  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_SPI3_SIGNAL) == SYSCFG_HIGHSPEED_SPI3_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN8R, 0x1018U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_SPI4_SIGNAL) == SYSCFG_HIGHSPEED_SPI4_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN9R, 0x1018U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_SPI5_SIGNAL) == SYSCFG_HIGHSPEED_SPI5_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN10R, 0x1018U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_LTDC_SIGNAL) == SYSCFG_HIGHSPEED_LTDC_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN11R, 0x1018U);
  }
}

/**
  * @brief  To Disable optimize the I/O speed when the product voltage is low.
  * @note   This bit is active only if PRODUCT_BELOW_25V user option bit is set. It must be
  *         used only if the product supply voltage is below 2.5 V. Setting this bit when VDD is
  *         higher than 2.5 V might be destructive.
  * @param  SYSCFG_HighSpeedSignal: Signal selection (TRACE, QUADSPI...)
  *   This parameter can be one or a combination of the following values:
  *   @arg SYSCFG_HIGHSPEED_TRACE_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_QUADSPI_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_ETH_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SDMMC_SIGNAL
  *   @arg SYSCFG_HIGHSPEED_SPI_SIGNAL
  * @retval None
  */
void HAL_SYSCFG_DisableIOSpeedOptimize(uint32_t SYSCFG_HighSpeedSignal)
{
  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_TRACE_SIGNAL) == SYSCFG_HIGHSPEED_TRACE_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN0R, 0x0U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_QUADSPI_SIGNAL) == SYSCFG_HIGHSPEED_QUADSPI_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN1R, 0x0U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_ETH1_SIGNAL) == SYSCFG_HIGHSPEED_ETH1_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN2R, 0x0U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_ETH2_SIGNAL) == SYSCFG_HIGHSPEED_ETH2_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN3R, 0x0U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_SDMMC1_SIGNAL) == SYSCFG_HIGHSPEED_SDMMC1_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN4R, 0x0U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_SDMMC2_SIGNAL) == SYSCFG_HIGHSPEED_SDMMC2_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN5R, 0x0U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_SPI1_SIGNAL) == SYSCFG_HIGHSPEED_SPI1_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN6R, 0x0U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_SPI2_SIGNAL) == SYSCFG_HIGHSPEED_SPI2_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN7R, 0x0U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_SPI3_SIGNAL) == SYSCFG_HIGHSPEED_SPI3_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN8R, 0x0U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_SPI4_SIGNAL) == SYSCFG_HIGHSPEED_SPI4_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN9R, 0x0U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_SPI5_SIGNAL) == SYSCFG_HIGHSPEED_SPI5_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN10R, 0x0U);
  }

  if ((SYSCFG_HighSpeedSignal & SYSCFG_HIGHSPEED_LTDC_SIGNAL) == SYSCFG_HIGHSPEED_LTDC_SIGNAL)
  {
    WRITE_REG(SYSCFG->HSLVEN11R, 0x0U);
  }
}

/**
  * @brief  Enable Compensation Cells
  * @param  CompCells correspond to Compensation cells.
  * This parameter can be one or a combination of the following values:
  *   @arg SYSCFG_MAIN_COMP_CELL
  *   @arg SYSCFG_SD1_COMP_CELL
  *   @arg SYSCFG_SD2_COMP_CELL
  * @retval None
  */
void HAL_SYSCFG_EnableCompensationCell(uint32_t CompCells)
{
  if ((CompCells & SYSCFG_MAIN_COMP_CELL) == SYSCFG_MAIN_COMP_CELL)
  {
    SYSCFG->CMPENSETR = SYSCFG_CMPENSETR_EN;
  }

  if ((CompCells & SYSCFG_SD1_COMP_CELL) == SYSCFG_SD1_COMP_CELL)
  {
    SYSCFG->CMPSD1ENSETR = SYSCFG_CMPSD1ENSETR_EN;
  }

  if ((CompCells & SYSCFG_SD2_COMP_CELL) == SYSCFG_SD2_COMP_CELL)
  {
    SYSCFG->CMPSD2ENSETR = SYSCFG_CMPSD2ENSETR_EN;
  }
}


/**
  * @brief  Disable Compensation Cells
  * @param  CompCells: correspond to Compensation cells.
  * This parameter can be one or a combination of the following values:
  *   @arg SYSCFG_MAIN_COMP_CELL
  *   @arg SYSCFG_SD1_COMP_CELL
  *   @arg SYSCFG_SD2_COMP_CELL
  * @retval None
  */
void HAL_SYSCFG_DisableCompensationCell(uint32_t CompCells)
{
  if ((CompCells & SYSCFG_MAIN_COMP_CELL) == SYSCFG_MAIN_COMP_CELL)
  {
    SYSCFG->CMPENCLRR = SYSCFG_CMPENCLRR_EN;
  }

  if ((CompCells & SYSCFG_SD1_COMP_CELL) == SYSCFG_SD1_COMP_CELL)
  {
    SYSCFG->CMPSD1ENCLRR = SYSCFG_CMPSD1ENCLRR_EN;
  }

  if ((CompCells & SYSCFG_SD2_COMP_CELL) == SYSCFG_SD2_COMP_CELL)
  {
    SYSCFG->CMPSD2ENCLRR = SYSCFG_CMPSD2ENCLRR_EN;
  }
}

/**
  * @brief  Code selection for the I/O Compensation cell
  * @param  SYSCFG_CompCode: Selects the code to be applied for the I/O compensation cell
  *   This parameter can be one of the following values:
  *   @arg SYSCFG_CELL_CODE : Select Code from the cell (available in the SYSCFG_CMPCRx)
  *   @arg SYSCFG_REGISTER_CODE: Select Code from RANSRC[3:0] and RAPSRC[3:0] register values
  * @param CompCells: correspond to Compensation cells.
  * This parameter can be one or a combination of the following values:
  *   @arg SYSCFG_MAIN_COMP_CELL
  *   @arg SYSCFG_SD1_COMP_CELL
  *   @arg SYSCFG_SD2_COMP_CELL
  * @retval None
  */
void HAL_SYSCFG_CompensationCodeSelect(uint32_t CompCells, uint32_t SYSCFG_CompCode)
{
  /* Check the parameter */
  assert_param(IS_SYSCFG_CODE_SELECT(SYSCFG_CompCode));

  if ((CompCells & SYSCFG_MAIN_COMP_CELL) == SYSCFG_MAIN_COMP_CELL)
  {
    MODIFY_REG(SYSCFG->CMPCR, SYSCFG_CMPCR_SW_CTRL, (uint32_t)(SYSCFG_CompCode));
  }


  if ((CompCells & SYSCFG_SD1_COMP_CELL) == SYSCFG_SD1_COMP_CELL)
  {
    MODIFY_REG(SYSCFG->CMPSD1CR, SYSCFG_CMPSD1CR_SW_CTRL, (uint32_t)(SYSCFG_CompCode));
  }


  if ((CompCells & SYSCFG_SD2_COMP_CELL) == SYSCFG_SD2_COMP_CELL)
  {
    MODIFY_REG(SYSCFG->CMPSD2CR, SYSCFG_CMPSD2CR_SW_CTRL, (uint32_t)(SYSCFG_CompCode));
  }

}

/**
  * @brief  Code selection for the I/O Compensation cell
  * @param CompCell: corresponding Compensation cell.
  * This parameter can be one of the following values:
  *   @arg SYSCFG_MAIN_COMP_CELL
  *   @arg SYSCFG_SD1_COMP_CELL
  *   @arg SYSCFG_SD2_COMP_CELL
  * @param  SYSCFG_PMOSCode: PMOS compensation code
  *         This code is applied to the I/O compensation cell when the CS bit of the
  *          SYSCFG_CMPCR is set
  * @param  SYSCFG_NMOSCode: NMOS compensation code
  *         This code is applied to the I/O compensation cell when the CS bit of the
  *          SYSCFG_CMPCR is set
  * @retval None
  */
void HAL_SYSCFG_CompensationCodeConfig(uint32_t CompCell, uint32_t SYSCFG_PMOSCode, uint32_t SYSCFG_NMOSCode)
{
  /* Check the parameter */
  assert_param(IS_SYSCFG_CODE_CONFIG(SYSCFG_PMOSCode));
  assert_param(IS_SYSCFG_CODE_CONFIG(SYSCFG_NMOSCode));

  if ((CompCell & SYSCFG_MAIN_COMP_CELL) == SYSCFG_MAIN_COMP_CELL)
  {
    MODIFY_REG(SYSCFG->CMPCR, SYSCFG_CMPCR_RANSRC | SYSCFG_CMPCR_RAPSRC, (((uint32_t)(SYSCFG_PMOSCode) << 20) |
                                                                          ((uint32_t)(SYSCFG_NMOSCode) << 16)));
  }

