zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal.c
  else if ((CompCell & SYSCFG_SD1_COMP_CELL) == SYSCFG_SD1_COMP_CELL)
  {
    MODIFY_REG(SYSCFG->CMPSD1CR, SYSCFG_CMPSD1CR_RANSRC | SYSCFG_CMPSD1CR_RAPSRC, (((uint32_t)(SYSCFG_PMOSCode) << 20) |
                                                                                   ((uint32_t)(SYSCFG_NMOSCode) << 16)))
    ;
  }

  else if ((CompCell & SYSCFG_SD2_COMP_CELL) == SYSCFG_SD2_COMP_CELL)
  {
    MODIFY_REG(SYSCFG->CMPSD2CR, SYSCFG_CMPSD2CR_RANSRC | SYSCFG_CMPSD2CR_RAPSRC, (((uint32_t)(SYSCFG_PMOSCode) << 20) |
                                                                                   ((uint32_t)(SYSCFG_NMOSCode) << 16)))
    ;
  }

  else
  {
    /* Nothing to do */
  }
}


/**
  * @brief  Disable IO compensation mechanism
  *         E.g. before going into STOP
  * @param CompCells: correspond to Compensation cells.
  * This parameter can be one or a combination of the following values:
  *   @arg SYSCFG_MAIN_COMP_CELL
  *   @arg SYSCFG_SD1_COMP_CELL
  *   @arg SYSCFG_SD2_COMP_CELL
  * @retval None
  */
void HAL_SYSCFG_DisableIOCompensation(uint32_t CompCells)
{
  uint32_t pmos_val;
  uint32_t nmos_val;

  if ((CompCells & SYSCFG_MAIN_COMP_CELL) == SYSCFG_MAIN_COMP_CELL)
  {
    /* Get Main I/O compensation cell values for PMOS and NMOS transistors */
    pmos_val = (__HAL_SYSCFG_MAIN_CELL_GET_PMOS_CMP() >> 28);
    nmos_val = (__HAL_SYSCFG_MAIN_CELL_GET_NMOS_CMP() >> 24);

    /* Copy actual value of APSRC[3:0]/ANSRC[3:0] in RAPSRC[3:0]/RANSRC[3:0] */
    HAL_SYSCFG_CompensationCodeConfig(SYSCFG_MAIN_COMP_CELL, pmos_val, nmos_val);
  }

  if ((CompCells & SYSCFG_SD1_COMP_CELL) == SYSCFG_SD1_COMP_CELL)
  {
    /* Get SDMMC1 I/O compensation cell values for PMOS and NMOS transistors */
    pmos_val = (__HAL_SYSCFG_SD1_CELL_GET_PMOS_CMP() >> 28);
    nmos_val = (__HAL_SYSCFG_SD1_CELL_GET_NMOS_CMP() >> 24);

    /* Copy actual value of APSRC[3:0]/ANSRC[3:0] in RAPSRC[3:0]/RANSRC[3:0] */
    HAL_SYSCFG_CompensationCodeConfig(SYSCFG_SD1_COMP_CELL, pmos_val, nmos_val);
  }

  if ((CompCells & SYSCFG_SD2_COMP_CELL) == SYSCFG_SD2_COMP_CELL)
  {
    /* Get SDMMC2 I/O compensation cell values for PMOS and NMOS transistors */
    pmos_val = (__HAL_SYSCFG_SD2_CELL_GET_PMOS_CMP() >> 28);
    nmos_val = (__HAL_SYSCFG_SD2_CELL_GET_NMOS_CMP() >> 24);

    /* Copy actual value of APSRC[3:0]/ANSRC[3:0] in RAPSRC[3:0]/RANSRC[3:0] */
    HAL_SYSCFG_CompensationCodeConfig(SYSCFG_SD2_COMP_CELL, pmos_val, nmos_val);
  }

  /* Set SW_CTRL = 1 */
  HAL_SYSCFG_CompensationCodeSelect(CompCells, SYSCFG_REGISTER_CODE);

  /* Disable the Compensation Cell */
  HAL_SYSCFG_DisableCompensationCell(CompCells);
}

/**
  * @brief  Enable IO compensation mechanism
  *         By default the I/O compensation cell is not used. However when the
  *         I/O output buffer speed is configured in 50 MHz mode and above, it
  *         is recommended to use the compensation cell for a slew rate control
  *         on I/O tf(IO)out/tr(IO)out commutation to reduce the I/O noise on
  *         the power supply.
  * @param CompCells: correspond to Compensation cells.
  * This parameter can be one or a combination of the following values:
  *   @arg SYSCFG_MAIN_COMP_CELL
  *   @arg SYSCFG_SD1_COMP_CELL
  *   @arg SYSCFG_SD2_COMP_CELL
  * @note   Use polling mode for timeout as code could be used on critical
  *         section (IRQs disabled)
  * @retval HAL_StatusTypeDef value
  */
HAL_StatusTypeDef HAL_SYSCFG_EnableIOCompensation(uint32_t CompCells)
{
  HAL_StatusTypeDef status = HAL_OK;
  __IO uint32_t count = SYSCFG_DEFAULT_TIMEOUT * (SystemCoreClock / 20U / 1000U);

  /* Set SYSCFG_CMPENSETR_EN */
  HAL_SYSCFG_EnableCompensationCell(CompCells);

  /* Wait for READY = 1 for all Cells*/
  if ((CompCells & SYSCFG_MAIN_COMP_CELL) == SYSCFG_MAIN_COMP_CELL)
  {
    do
    {
      if (count-- == 0U)
      {
        return HAL_TIMEOUT;
      }
    } while (__HAL_SYSCFG_MAIN_CMP_CELL_GET_FLAG() == 0U);
  }

  if ((CompCells & SYSCFG_SD1_COMP_CELL) == SYSCFG_SD1_COMP_CELL)
  {
    count = SYSCFG_DEFAULT_TIMEOUT * (SystemCoreClock / 20U / 1000U);
    do
    {
      if (count-- == 0U)
      {
        return HAL_TIMEOUT;
      }
    } while (__HAL_SYSCFG_SD1_CMP_CELL_GET_FLAG() == 0U);
  }

  if ((CompCells & SYSCFG_SD2_COMP_CELL) == SYSCFG_SD2_COMP_CELL)
  {
    count = SYSCFG_DEFAULT_TIMEOUT * (SystemCoreClock / 20U / 1000U);
    do
    {
      if (count-- == 0U)
      {
        return HAL_TIMEOUT;
      }
    } while (__HAL_SYSCFG_SD2_CMP_CELL_GET_FLAG() == 0U);
  }

  /* Set SW_CTRL = 0 */
  HAL_SYSCFG_CompensationCodeSelect(CompCells, SYSCFG_CELL_CODE);

  return status;
}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
